# Intermediate SQL

## Filtering Records

#### Using BETWEEN

This time you'll write a query to get the `title` and `release_year` of films released in 1990 or 1999, which were in English or Spanish and took in more than $2,000,000 `gross`.

It looks like a lot, but you can build the query up one step at a time to get comfortable with the underlying concept in each step. Let's go!

In [1]:
import cx_Oracle
import pandas as pd

def print_all():
    connection = cx_Oracle.connect(user="DATASETS_CHAN", password="123", dsn="localhost:1521/xe")
    cursor = connection.cursor()
    cursor.execute("SELECT * FROM FILMS")
    return pd.DataFrame(cursor)

def run_statement(sql):
    connection = cx_Oracle.connect(user="DATASETS_CHAN", password="123", dsn="localhost:1521/xe")
    cursor = connection.cursor()
    cursor.execute(sql)
    display(pd.DataFrame(cursor))

#### Instructions
* Select the `title` and `release_year` of all films released between 1990 and 2000 (inclusive) using `BETWEEN`

In [2]:
# -- Find the title and year of films from the 1990 or 1999
sql = """
SELECT title, release_year
FROM films
WHERE release_year
    BETWEEN 1990 AND 2000
"""
run_statement(sql)

                               0     1
0                  Arachnophobia  1990
1    Back to the Future Part III  1990
2                 Child's Play 2  1990
3             Dances with Wolves  1990
4                Days of Thunder  1990
..                           ...   ...
952                      Whipped  2000
953                 Woman on Top  2000
954                  Wonder Boys  2000
955                        X-Men  2000
956          You Can Count on Me  2000

[957 rows x 2 columns]

* Build on your previous query to select only films with a `budget` over $100 million.

In [4]:
# -- Update the query to see all German-language films released after 2000
sql = """
SELECT title, release_year
FROM films
WHERE release_year
    BETWEEN 1990 AND 2000
-- Narrow down your query to films with budgets > $100 million
    AND budget > 100000000
"""
run_statement(sql)

                                            0     1
0                  Terminator 2: Judgment Day  1991
1                                   True Lies  1994
2                                  Waterworld  1995
3                              Batman & Robin  1997
4                                Dante's Peak  1997
5                           Princess Mononoke  1997
6                     Speed 2: Cruise Control  1997
7                           Starship Troopers  1997
8                                     Titanic  1997
9                         Tomorrow Never Dies  1997
10                               A Bug's Life  1998
11                                       Antz  1998
12                                 Armageddon  1998
13    Les couloirs du temps: Les visiteurs II  1998
14                            Lethal Weapon 4  1998
15                                      Tango  1998
16                              Godzilla 2000  1999
17  Star Wars: Episode I - The Phantom Menace  1999
18                              Stuart Little  1999
19    The Messenger: The Story of Joan of Arc  1999
20                    The World Is Not Enough  1999
21                             Wild Wild West  1999
22                                   Dinosaur  2000
23                                  Gladiator  2000
24             How the Grinch Stole Christmas  2000
25                     Mission: Impossible II  2000
26                                The Patriot  2000
27                          The Perfect Storm  2000

* Now, restrict the query to only return Spanish-language films.

In [7]:
# -- Select all records for German-language films released after 2000 and before 2010
sql = """
SELECT title, release_year
FROM films
WHERE release_year BETWEEN 1990 AND 2000
    AND budget > 100000000
-- Restrict the query to only Spanish-language films
    AND language = 'Spanish'
"""
run_statement(sql)

       0     1
0  Tango  1998

* Finally, amend the query to include all Spanish-language `or` French-language films with the same criteria.

In [9]:
sql = """
SELECT title, release_year
FROM films
WHERE release_year BETWEEN 1990 AND 2000
	AND budget > 100000000
-- Amend the query to include Spanish or French-language films
	AND (language = 'Spanish' OR language = 'French')
"""
run_statement(sql)

                                         0     1
0  Les couloirs du temps: Les visiteurs II  1998
1                                    Tango  1998